// Задача 1: Задайте двумерный массив символов (тип char [,]). Создать строку из символов этого массива.
// char[,] array = new char[,] { { 'a', 'b', '2', 'd', 'e' }, { '!', 'g', 'h', '1', 'j' } };

// string GetStringFromCharArray(char[,] array)
// {
//     string result = string.Empty;
//     foreach (char symbol in array)
//     {
//         result += symbol; // result = result + symbol
//     }
//     return result;
// }
// Console.WriteLine(GetStringFromCharArray(array));



// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.





// Задача 3: Задайте произвольную строку. Выясните, является ли она палиндромом.

// Задача 4*(не обязательная): Задайте строку, состоящую из слов, разделенных пробелами. Сформировать строку, в которой слова расположены в обратном порядке. В полученной строке слова должны быть также разделены пробелами.